import Layout from '/components/Layout';
import Head from "next/head";
import {Box, Center, Flex, Heading, Text} from "@chakra-ui/react";
import Image from "next/image";
import img from "../public/data.png";


export default function Database( ) {
    return <Layout >
        <Head>
            <title>Database </title>
        </Head>

        <div>
            <Flex direction={['column','row']} mb='4em' >
                <Center p={['1em','4em','10em']}>
                    <Box p='4'>
                        <Heading size='2xl' pb='1em'>Робота з даними</Heading>
                        <Text fontSize='xl' w='60%'>Зростання кількості пристроїв і цифрових інтерфейсів до всього генерує величезні обсяги даних, які компанії хочуть проаналізувати та зрозуміти для оптимізації та переваг</Text>
                    </Box>
                </Center>
                <Box mr='10em' w='100%'  bg='grey.400'>
                    <Image src={img}  quality={100}/>
                </Box>
            </Flex>
            <Box p={['1em','4em']}>
                <Box p={['1em','4em']}>
                    <Heading size='2xl' pb='1em'>Data Analyst</Heading>
                    <Text fontSize='xl' >Аналітики даних відповідають за збір і організацію великих наборів даних, а потім, як випливає з назви, аналізують ці дані та використовують їх аналіз для створення конкретних бізнес-висновків, незалежно від того, як ефективно ціноутворити продукти, скоротити витрати чи покращити утримання клієнтів. Аналітики даних також відповідають за управління всіма, що стосуються даних, включаючи звітність, аналіз даних і точність вхідних даних.</Text>
                    </Box>
                <Box p={['1em','4em']}>
                    <Heading size='2xl' pb='1em'>Data Scientist</Heading>
                    <Text fontSize='xl' >У той час як основна відповідальність аналітика даних полягає в тому, щоб досліджувати та аналізувати дані, основна функція вченого з даних полягає в тому, щоб створити основу для такого аналізу. Це включає впровадження статистичних моделей і алгоритмів, проведення тестування та експериментів даних, розробку продуктів даних і постійну оптимізацію їх платформи для кращого аналізу даних — і все це з метою досягнення найбільш точних бізнес-висновків.</Text>
                </Box>
                <Box p={['1em','4em']}>
                    <Heading size='2xl' pb='1em'>Machine Learning Engineer</Heading>
                    <Text fontSize='xl' >Інженери з машинного навчання — це програмісти, які створюють алгоритми, моделі, системи та каркаси, які дозволяють машинам ефективно навчатися та виконувати функції незалежно — команди не потрібні. Інженери з машинного навчання також відповідають за перетворення моделей, створених науковцями з даних, у реальний код, який можна використовувати у виробництві.</Text>
                </Box>
                <Box p={['1em','4em']}>
                    <Heading size='2xl' pb='1em'>Data Architect</Heading>
                    <Text fontSize='xl' >Так само, як архітектор проектує фізичні структури, архітектор даних проектує структури, необхідні організації для ефективного отримання, організації, аналізу, керування та використання даних. Це включає в себе переклад бізнес-цілей в структуру управління даними, розробку фреймворку, визначення того, як дані будуть проходити через фреймворк, а також співпрацю з іншими командами та інженерами для розробки платформи та її впровадження в організації.</Text>
                </Box>
            </Box>
        </div>

    </Layout>;
}
