import Layout from '/components/Layout';
import Head from "next/head";
import {Box, Center, Flex, Heading, Text} from "@chakra-ui/react";
import Image from "next/image";
import img from "../public/notTech.png";


export default function NotTech( ) {
    return <Layout >
        <Head>
            <title>Not Tech </title>
        </Head>

        <div>
            <Flex justify='space-evenly' mb='3em' mt='3em' >
                <Center ml='10em'>
                    <Box p='4'>
                        <Heading size='2xl' pb='1em'>&ldquo;Нетехнічні&ldquo; професії</Heading>
                        <Text fontSize='xl'>Якщо сидіти і писати код це не про вас,
                            <br/>то IT сфера також має що запропонувати </Text>
                    </Box>
                </Center>
                <Box mr='5em'  bg='grey.400'>
                    <Image src={img}  quality={100}/>
                </Box>
            </Flex>
            <Box p='4em'>
                <Box p='4em'>
                    <Heading size='2xl' pb='1em'>Проєкт менеджер</Heading>
                    <Text fontSize='xl' >Менеджер проєкту може бути відповідальним за планування, виконання та завершення будь-якого проєкту, а також в будь-яких дотичних операціях, що мають визначений початок та кінець, незалежно від індустрії — наприклад, у галузях, таких як будівельна, прокладанні кабельних мереж, телекомунікації або розробка програмного забезпечення. У галузях виробництва та надання послуг також існують менеджери проєктів. Проєктний менеджер є першою точкою контакту стосовно будь-яких проблем чи випадків, які ескалюються керівниками різноманітних відділень у організації, перед тим як бути переадресованими до вищих щаблів керівництва</Text>
                     </Box>
                <Box p='4em'>
                    <Heading size='2xl' pb='1em'>HR менеджер</Heading>
                    <Text fontSize='xl' > HR-фахівець - фахівець з управління людськими ресурсами, персоналом організації. Менеджери з персоналу - це люди-універсали, які можуть виконувати роботу кадровика, рекрутера і HR-а разом узятих</Text>
                </Box>
                <Box p='4em'><Heading size='2xl' pb='1em'>Support manager</Heading>
                    <Text fontSize='xl' >Support Engineer  є представником служби технічної підтримки, який розглядає заявки від користувачів продукту або інших інженерів техпідтримки. Залежно від типу заявки, цей фахівець вирішує проблему самостійно або передає на розгляд колегам</Text>
                </Box>
            <Box p='4em'>
                <Heading size='2xl' pb='1em'>UI/UX дизайнер</Heading>
                <Text fontSize='xl' >UI/UX дизайнер — це креативний фахівець, який проектує призначені для користувача інтерфейси. UI і UX — це два різних сторони дизайну, але частіше за все завдання по обох напрямках тісно пов’язані між собою, а тому їх робить один універсальний фахівець. Така професія має довгу історію. Будь-яке налаштування зовнішнього вигляду товару (упаковка, ергономічність, зовнішня реклама) можна назвати UI/UX-дизайном, адже з його допомогою кінцевий продукт стає зручним для покупця. Різниця тільки в одному — сучасні UI/UX дизайнери використовують сучасні інструменти</Text>
            </Box>
            <Box p='4em'>
                <Heading size='2xl' pb='1em'>
                2D/3D дизайнер</Heading>
                <Text fontSize='xl' >Якщо UI вирішує проблему дизайну зі сторони компонування, то ця професія зі сторони наповнення. Створення логотипів, брендбуків компаній тощо.Також є робота в них і в створенні ігор: дизайн персонажів, створення макетів, текстур,рівнів.</Text>
            </Box>
            </Box>
        </div>

    </Layout>;
}
